#!/usr/bin/env python
# coding: utf-8

# In[1]:


import json


# ## Msg
# https://github.com/ideless/artifact

# - 提升同样的次数，有效词条数量不同，多者包含少者的有效词条，

# ## Map

# In[13]:


stat_map = {
    'hp': '小生命',
    'atk': '小攻击',
    'def': '小防御',
    'hp_': '大生命',
    'atk_': '大攻击',
    'def_': '大防御',
    'eleMas': '精通',
    'enerRech_': '充能',
    'heal_': '治疗',
    'critRate_': '暴击',
    'critDMG_': '爆伤',
    'pyro_dmg_': '火伤',
    'hydro_dmg_': '水伤',
    'electro_dmg_': '雷伤',
    'anemo_dmg_': '风伤',
    'cryo_dmg_': '冰伤',
    'geo_dmg_': '岩伤',
    'physical_dmg_': '物伤',
    'dendro_dmg_': '草伤'
}

小生命 = "小生命"
小攻击 = "小攻击"
小防御 = "小防御"
大生命 = "大生命"
大攻击 = "大攻击"
大防御 = "大防御"
精通 = "精通"
充能 = "充能"
治疗 = "治疗"
暴击 = "暴击"
爆伤 = "爆伤"
火伤 = "火伤"
水伤 = "水伤"
雷伤 = "雷伤"
风伤 = "风伤"
冰伤 = "冰伤"
岩伤 = "岩伤"
物伤 = "物伤"
草伤 = "草伤"

set_map = {
    'Instructor': '教官',
    'GladiatorsFinale': '角斗',
    'WanderersTroupe': '乐团',
    'Thundersoother': '平息',
    'ThunderingFury': '如雷',
    'MaidenBeloved': '少女',
    'ViridescentVenerer': '风套',
    'CrimsonWitchOfFlames': '魔女',
    'Lavawalker': '渡火',
    'NoblesseOblige': '宗室',
    'BloodstainedChivalry': '染血',
    'ArchaicPetra': '磐岩',
    'RetracingBolide': '逆飞',
    'BlizzardStrayer': '冰套',
    'HeartOfDepth': '沉沦',
    'TenacityOfTheMillelith': '千岩',
    'PaleFlame': '苍白',
    'ShimenawasReminiscence': '追忆',
    'EmblemOfSeveredFate': '绝缘',
    'HuskOfOpulentDreams': '华馆',
    'OceanHuedClam': '海染',
    'VermillionHereafter': '辰砂',
    'EchoesOfAnOffering': '余响',
    'DeepwoodMemories': '草套',
    'GildedDreams': '饰金',
    'DesertPavilionChronicle': '楼阁',
    'FlowerOfParadiseLost': '乐园',
    'NymphsDream': '水仙',
    'VourukashasGlow': '花海'
}

教官 = "教官"
角斗 = "角斗"
乐团 = "乐团"
平息 = "平息"
如雷 = "如雷"
少女 = "少女"
风套 = "风套"
魔女 = "魔女"
渡火 = "渡火"
宗室 = "宗室"
染血 = "染血"
磐岩 = "磐岩"
逆飞 = "逆飞"
冰套 = "冰套"
沉沦 = "沉沦"
千岩 = "千岩"
苍白 = "苍白"
追忆 = "追忆"
绝缘 = "绝缘"
华馆 = "华馆"
海染 = "海染"
辰砂 = "辰砂"
余响 = "余响"
草套 = "草套"
饰金 = "饰金"
楼阁 = "楼阁"
乐园 = "乐园"
水仙 = "水仙"
花海 = "花海"

slot_map = {
    "flower": "花",
    "plume": "羽",
    "sands": "沙",
    "goblet": "杯",
    "circlet": "头"
}

花 = "花"
羽 = "羽"
沙 = "沙"
杯 = "杯"
头 = "头"


# ## Rule

# In[20]:


rules = [
    # 魈
    # 甘雨
]

# 小号


# 宵宫
tmp = {暴击: 1.0, 爆伤: 1.0, 大攻击: 0.57, 精通: 0.65}
rules += [
    [[追忆], [花, 羽], None, tmp],
    [[追忆], [沙], [大攻击], tmp],
    [[追忆], [沙], [精通], tmp],
    [None, [杯], [火伤], tmp],
    [[追忆], [头], [暴击], tmp],
]


# 香菱
tmp = {暴击: 1.0, 爆伤: 1.0, 大攻击: 0.65, 精通: 0.7, 充能: 1.0}
rules += [
    [[绝缘], [花, 羽], None, tmp],
    [[绝缘], [沙], [充能], tmp],
    [None, [杯], [火伤], tmp],
    [[绝缘], [头], [暴击], tmp]
]

# 魈
tmp = {暴击: 1.0, 爆伤: 1.0, 大攻击: 0.7, 充能: 0.4}
tmp2 = [绝缘, 追忆, 角斗, 辰砂, 余响]
rules += [
    [tmp2, [花, 羽], None, tmp],
    [tmp2, [沙], [大攻击], tmp],
    [None, [杯], [风伤], tmp],
    [tmp2, [头], [暴击, 爆伤], tmp]
]

# 夜兰
tmp = {暴击: 1.0, 爆伤: 1.0, 大生命: 1.0, 充能: 1.0, 精通: 0.3}
tmp2 = [绝缘, 千岩, 沉沦, 花海, 水仙]
rules += [
    [tmp2, [花, 羽], None, tmp],
    [tmp2, [沙], [大生命], tmp],
    [None, [杯], [水伤], tmp],
    [tmp2, [头], [暴击, 爆伤], tmp]
]

# 大号

# 云堇
tmp = {大防御: 1.0, 小防御: 0.4, 充能: 1.0, 暴击: 1.0}
tmp2 = [绝缘, 华馆, 宗室, 磐岩]
rules += [
    [tmp2, [花, 羽], None, tmp],
    [tmp2, [沙], [大防御], tmp],
    [None, [杯], [大防御], tmp],
    [tmp2, [头], [大防御], tmp]
]

rules
None


# ## Load json

# In[4]:


jsonfilename = "good.json"
with open(jsonfilename, "r") as f:
    jsondata = json.load(f)
    assert jsondata["format"] == "GOOD"
    artifacts = jsondata["artifacts"]
    for idx in range(len(artifacts)):
        art = artifacts[idx]
        art["index"] = idx
        art["setKey"] = set_map[art["setKey"]]
        art["slotKey"] = slot_map[art["slotKey"]]
        art["mainStatKey"] = stat_map[art["mainStatKey"]]
        for sub in art["substats"]:
            sub["key"] = stat_map[sub["key"]]

    with open("arts_zhCH.json", "w") as f_zhCH:
        json.dump(artifacts, f_zhCH)


# ## Setting

# In[5]:


base_score = 6.6
main_full = {
    小生命: 4780,
    小攻击: 311,
    小防御: 370.4,
    大生命: 46.6,
    大攻击: 46.6,
    大防御: 58.3,
    精通: 187,
    充能: 51.8,
    治疗: 35.9,
    暴击: 31.1,
    爆伤: 62.2,
    火伤: 46.6,
    水伤: 46.6,
    雷伤: 46.6,
    风伤: 46.6,
    冰伤: 46.6,
    岩伤: 46.6,
    物伤: 46.6,
    草伤: 46.6
}

single = {k: v / 62.2 * base_score for k, v in main_full.items()}
for k in [小生命, 小攻击, 小防御]:
    single[k] /= 2
single = {k: round(v, 2) for k, v in single.items()}
single


# ## tools

# In[6]:


def print_art(art):
    d_set, d_slot, d_main, d_level = \
        art["setKey"], art["slotKey"], art["mainStatKey"], art["level"]
    print(d_set, d_slot, d_level, d_main,
          ", ".join([f"{x['key']}: {x['value']}" for x in art["substats"]]))


print_bak = print


def print_off():
    global print

    def do_nothing(*args, **kargs):
        pass
    print = do_nothing


def print_on():
    global print
    print = print_bak


# ## Rule handler

# In[7]:


k_list = [0.4, 0.3, 0.2, 0.1]
k_list = [0.25 for _ in range(4)]


def rule_handler(rule, art):

    r_set, r_slot, r_main, r_sub = rule
    d_set, d_slot, d_main, d_sub = \
        art["setKey"], art["slotKey"], art["mainStatKey"], art["substats"]
    # print(r_set, r_slot, r_main, r_sub)
    # print(d_set, d_slot, d_main, d_sub)
    if (not r_set or d_set in r_set) and \
       (not r_slot or d_slot in r_slot) and \
       (not r_main or d_main in r_main):
        print("match")
        print(rule)
        print_art(art)
        # 排个序
        r_sub = sorted(r_sub.items(), key=lambda x: x[1], reverse=True)
        print("sorted", r_sub)
        # 剩余提升次数
        left_time = 5 - art["level"] // 4
        d_sub = {x["key"]: x["value"] for x in d_sub}
        if (len(d_sub) == 3):
            left_time -= 1  # 减一次提升次数，后续看情况补偿
        k_iter = iter(range(5))
        total_score = 0
        print(f"{art['level']=}, {left_time=}")
        for key, k_score in r_sub:
            v = d_sub.get(key, None)
            if v is not None:
                print(f"{key=}, {k_score=}, {v=}")
                mayget = left_time * k_list[next(k_iter)]
                cur_score = v / single[key] * base_score * k_score
                score = cur_score + mayget * base_score * k_score
                print(f"{cur_score=}, {mayget=}, {score=}")
                total_score += score
        i = next(k_iter)
        if i < len(r_sub) and len(d_sub) == 3:
            key, k_score = r_sub[i]
            score = 1 * base_score * k_score / 2
            print(f"addition {score=}")
            total_score += score
        print(f"{total_score=}")
        print()
        return total_score
    return 0


def handle_rule_arts(rule, arts):
    res = []
    for idx in range(len(arts)):
        score = rule_handler(rule, arts[idx])
        if score > 0:
            res.append((idx, score))
    return sorted(res, key=lambda x: x[1], reverse=True)


# ## test

# In[18]:


test_rules = [
    [['追忆'], ['花', '羽'], None, {'暴击': 1.0, '爆伤': 1.0, '大攻击': 0.6, '精通': 0.8}],
    [[乐团, 饰金, 花海], ['花', '羽'], None, {'精通': 1.0, '充能': 1.0}]
]


def test(test_rules):
    print(f"{k_list=}")
    for r in test_rules:
        print_off()
        res = handle_rule_arts(r, artifacts)
        print_on()
        print(r)
        for idx, score in res[:5]:
            # if score <= 20:
            #     break
            print(round(score, 1), end=" ")
            print_art(artifacts[idx])


test(test_rules)


# ## main

# In[21]:


test(rules)


# ## log
# 
# 
# ```
# [['追忆'], ['花', '羽'], None, {'暴击': 1.0, '爆伤': 1.0, '大攻击': 0.57, '精通': 0.65}]
# 50.0 追忆 羽 20 小攻击 精通: 33.0, 暴击: 9.7, 大攻击: 10.5, 爆伤: 15.5
# 42.8 追忆 羽 20 小攻击 大攻击: 5.3, 暴击: 9.7, 大防御: 13.1, 爆伤: 19.4
# 40.8 追忆 羽 2 小攻击 爆伤: 7.8, 小防御: 21.0, 精通: 19.0, 暴击: 3.5
# 39.1 追忆 羽 20 小攻击 小生命: 239.0, 爆伤: 22.5, 大攻击: 10.5, 精通: 40.0
# 38.8 追忆 花 3 小生命 爆伤: 6.2, 暴击: 3.9, 大攻击: 4.7, 小防御: 19.0
# 37.6 追忆 花 2 小生命 精通: 23.0, 爆伤: 5.4, 小防御: 21.0, 暴击: 2.7
# 36.8 追忆 羽 3 小攻击 爆伤: 6.2, 暴击: 2.7, 充能: 4.5, 大攻击: 5.3
# 36.8 追忆 花 20 小生命 大攻击: 10.5, 大生命: 4.7, 爆伤: 28.8, 小攻击: 14.0
# 36.7 追忆 花 2 小生命 精通: 23.0, 暴击: 2.7, 爆伤: 7.0
# 36.7 追忆 花 20 小生命 大攻击: 10.5, 暴击: 6.6, 小攻击: 31.0, 爆伤: 15.5
# 35.7 追忆 花 3 小生命 暴击: 3.5, 大攻击: 5.8, 爆伤: 5.4
# 35.5 追忆 羽 20 小攻击 暴击: 7.4, 爆伤: 13.2, 小防御: 39.0, 大攻击: 9.9
# 33.5 追忆 花 3 小生命 小防御: 19.0, 暴击: 3.1, 精通: 23.0, 大攻击: 5.3
# 33.5 追忆 花 2 小生命 精通: 19.0, 大攻击: 5.3, 大防御: 6.6, 暴击: 3.5
# 33.4 追忆 花 20 小生命 小攻击: 19.0, 暴击: 10.5, 大攻击: 16.3, 大防御: 5.1
# 33.2 追忆 羽 15 小攻击 小生命: 299.0, 爆伤: 13.2, 精通: 42.0, 大攻击: 4.7
# 32.9 追忆 花 19 小生命 大防御: 5.1, 大生命: 11.1, 暴击: 3.9, 爆伤: 21.8
# 32.7 追忆 花 0 小生命 爆伤: 5.4, 大攻击: 5.8, 充能: 5.2, 精通: 21.0
# 31.7 追忆 花 3 小生命 大攻击: 5.3, 暴击: 3.1, 精通: 23.0
# 31.7 追忆 花 0 小生命 大攻击: 5.8, 暴击: 3.1, 精通: 21.0
# 31.6 追忆 羽 7 小攻击 暴击: 2.7, 小防御: 16.0, 大攻击: 4.7, 精通: 37.0
# 31.5 追忆 羽 15 小攻击 精通: 63.0, 小防御: 21.0, 暴击: 6.2, 充能: 5.8
# 31.2 追忆 花 2 小生命 精通: 21.0, 大攻击: 4.1, 暴击: 3.5
# 31.2 追忆 羽 20 小攻击 大防御: 5.8, 充能: 9.7, 暴击: 10.5, 精通: 47.0
# 31.1 追忆 羽 3 小攻击 暴击: 3.1, 大攻击: 4.1, 小防御: 19.0, 精通: 16.0
# 30.9 追忆 羽 3 小攻击 大攻击: 4.1, 精通: 16.0, 暴击: 3.9
# 30.8 追忆 花 19 小生命 充能: 9.1, 大攻击: 10.5, 小攻击: 14.0, 爆伤: 20.2
# 30.8 追忆 花 3 小生命 大攻击: 4.7, 小攻击: 19.0, 暴击: 2.7, 精通: 16.0
# 30.7 追忆 羽 15 小攻击 小生命: 568.0, 爆伤: 15.5, 大攻击: 5.8, 精通: 16.0
# 30.6 追忆 花 19 小生命 暴击: 7.8, 大攻击: 16.3, 小攻击: 14.0, 大防御: 13.9
# 30.4 追忆 羽 3 小攻击 精通: 21.0, 暴击: 3.1, 大攻击: 4.1
# 30.3 追忆 花 20 小生命 大防御: 6.6, 小防御: 44.0, 暴击: 2.7, 爆伤: 24.9
# 30.1 追忆 花 3 小生命 爆伤: 7.8, 暴击: 3.5, 小防御: 23.0
# 30.1 追忆 花 3 小生命 爆伤: 7.0, 小防御: 23.0, 暴击: 3.9
# 29.8 追忆 羽 15 小攻击 大攻击: 4.7, 充能: 12.3, 爆伤: 21.0, 小生命: 209.0
# 29.7 追忆 羽 3 小攻击 暴击: 3.5, 大防御: 7.3, 爆伤: 6.2, 充能: 5.2
# 29.3 追忆 羽 3 小攻击 暴击: 3.1, 爆伤: 7.8, 大生命: 5.8
# 29.0 追忆 羽 15 小攻击 大生命: 4.7, 充能: 10.4, 大攻击: 5.8, 暴击: 9.7
# 28.5 追忆 花 3 小生命 暴击: 3.1, 大生命: 4.7, 爆伤: 7.0
# 28.5 追忆 花 3 小生命 暴击: 3.9, 爆伤: 5.4, 大防御: 5.8
# 28.2 追忆 花 18 小生命 大攻击: 16.3, 小防御: 21.0, 爆伤: 13.2, 大生命: 9.9
# 28.1 追忆 花 3 小生命 充能: 5.8, 暴击: 2.7, 爆伤: 6.2, 小防御: 16.0
# 27.7 追忆 花 0 小生命 爆伤: 6.2, 小攻击: 19.0, 暴击: 3.1
# 27.7 追忆 花 3 小生命 暴击: 3.5, 充能: 5.2, 爆伤: 5.4
# 27.7 追忆 花 3 小生命 小攻击: 14.0, 暴击: 3.5, 爆伤: 5.4
# 27.7 追忆 花 7 小生命 小攻击: 14.0, 爆伤: 5.4, 大攻击: 4.7, 精通: 19.0
# 27.5 追忆 羽 11 小攻击 精通: 21.0, 充能: 11.0, 小防御: 16.0, 暴击: 7.4
# 27.3 追忆 花 16 小生命 暴击: 5.8, 爆伤: 12.4, 小攻击: 18.0, 小防御: 39.0
# 27.3 追忆 羽 3 小攻击 爆伤: 5.4, 小生命: 209.0, 暴击: 2.7, 大生命: 5.3
# 26.9 追忆 花 3 小生命 暴击: 2.7, 大生命: 4.1, 爆伤: 6.2
# 26.1 追忆 羽 2 小攻击 暴击: 2.7, 小生命: 239.0, 爆伤: 5.4
# 25.9 追忆 羽 15 小攻击 暴击: 6.6, 小生命: 299.0, 充能: 5.8, 大攻击: 9.9
# 25.8 追忆 花 3 小生命 暴击: 3.9, 充能: 6.5, 精通: 23.0
# 25.8 追忆 羽 0 小攻击 精通: 23.0, 充能: 4.5, 爆伤: 7.8
# 25.8 追忆 花 11 小生命 充能: 6.5, 小攻击: 19.0, 爆伤: 14.0, 大攻击: 5.3
# 25.0 追忆 花 2 小生命 充能: 5.8, 精通: 23.0, 暴击: 3.5
# 24.7 追忆 花 20 小生命 爆伤: 14.0, 大防御: 7.3, 大攻击: 14.0, 充能: 13.6
# 24.4 追忆 花 3 小生命 大攻击: 5.8, 充能: 5.8, 小攻击: 16.0, 爆伤: 7.0
# 24.4 追忆 羽 0 小攻击 爆伤: 6.2, 大生命: 5.3, 小防御: 19.0, 精通: 21.0
# 24.3 追忆 羽 3 小攻击 充能: 6.5, 暴击: 3.9, 精通: 16.0
# 24.0 追忆 羽 20 小攻击 小生命: 239.0, 大防御: 22.6, 暴击: 5.8, 爆伤: 12.4
# 23.9 追忆 羽 0 小攻击 爆伤: 7.0, 大防御: 6.6, 大攻击: 5.8
# 23.9 追忆 花 3 小生命 爆伤: 6.2, 精通: 19.0, 小防御: 23.0, 大生命: 4.1
# 23.8 追忆 羽 3 小攻击 充能: 4.5, 精通: 21.0, 暴击: 3.1
# 23.5 追忆 羽 3 小攻击 充能: 6.5, 暴击: 3.5, 大攻击: 5.3
# 23.4 追忆 花 20 小生命 爆伤: 19.4, 大生命: 11.7, 大攻击: 5.3, 充能: 10.4
# 23.4 追忆 花 2 小生命 爆伤: 7.8, 充能: 5.8, 大攻击: 4.1
# 23.4 追忆 花 0 小生命 大攻击: 4.1, 暴击: 3.9, 小攻击: 14.0
# 23.4 追忆 花 0 小生命 大生命: 4.7, 大攻击: 4.1, 爆伤: 7.8
# 23.4 追忆 羽 0 小攻击 爆伤: 7.8, 小生命: 269.0, 大攻击: 4.1
# 23.0 追忆 花 2 小生命 爆伤: 5.4, 精通: 21.0, 充能: 5.2
# 22.8 追忆 羽 7 小攻击 小生命: 299.0, 精通: 19.0, 暴击: 3.9, 充能: 4.5
# 22.6 追忆 花 3 小生命 大攻击: 4.1, 爆伤: 7.0, 充能: 5.8
# 22.5 追忆 羽 0 小攻击 小防御: 21.0, 大生命: 5.3, 爆伤: 5.4, 精通: 16.0
# 22.4 追忆 花 7 小生命 暴击: 3.5, 小攻击: 14.0, 充能: 5.8, 精通: 21.0
# 22.3 追忆 羽 2 小攻击 大攻击: 4.1, 充能: 6.5, 大防御: 7.3, 暴击: 3.1
# 21.9 追忆 花 3 小生命 爆伤: 5.4, 大攻击: 5.3, 充能: 5.2
# 21.9 追忆 花 15 小生命 小攻击: 19.0, 充能: 6.5, 大生命: 9.9, 暴击: 9.3
# 21.6 追忆 羽 4 小攻击 暴击: 3.1, 大防御: 5.1, 精通: 21.0, 大生命: 4.7
# 21.0 追忆 羽 20 小攻击 暴击: 3.5, 爆伤: 14.0, 大生命: 10.5, 充能: 16.2
# [['追忆'], ['沙'], ['大攻击'], {'暴击': 1.0, '爆伤': 1.0, '精通': 0.65}]
# 32.6 追忆 沙 20 大攻击 小攻击: 14.0, 小防御: 46.0, 爆伤: 7.0, 暴击: 12.8
# 29.0 追忆 沙 20 大攻击 大防御: 11.7, 爆伤: 21.0, 精通: 37.0, 大生命: 9.9
# 27.7 追忆 沙 3 大攻击 暴击: 3.1, 小攻击: 19.0, 爆伤: 6.2
# 25.8 追忆 沙 3 大攻击 大防御: 6.6, 精通: 23.0, 暴击: 3.9
# 25.4 追忆 沙 3 大攻击 精通: 21.0, 暴击: 3.9, 小生命: 239.0
# 24.8 追忆 沙 3 大攻击 爆伤: 6.2, 大防御: 6.6, 精通: 23.0, 小生命: 269.0
# 24.6 追忆 沙 3 大攻击 小攻击: 19.0, 精通: 21.0, 暴击: 3.5
# 24.3 追忆 沙 3 大攻击 小防御: 16.0, 暴击: 3.9, 精通: 16.0
# 24.1 追忆 沙 3 大攻击 爆伤: 7.0, 精通: 19.0, 小攻击: 16.0
# 24.1 追忆 沙 2 大攻击 爆伤: 7.0, 精通: 19.0, 充能: 5.8
# 23.8 追忆 沙 3 大攻击 精通: 21.0, 大生命: 5.8, 暴击: 3.1
# 23.3 追忆 沙 3 大攻击 小防御: 21.0, 暴击: 3.1, 精通: 19.0
# 23.3 追忆 沙 3 大攻击 精通: 19.0, 小攻击: 19.0, 暴击: 3.1
# 22.7 追忆 沙 3 大攻击 精通: 16.0, 爆伤: 6.2, 小防御: 19.0
# [['追忆'], ['沙'], ['精通'], {'暴击': 1.0, '爆伤': 1.0, '大攻击': 0.57}]
# 25.3 追忆 沙 20 精通 大防御: 5.1, 小生命: 508.0, 暴击: 7.8, 大攻击: 12.8
# 24.4 追忆 沙 0 精通 小防御: 23.0, 大攻击: 5.8, 小生命: 209.0, 暴击: 3.5
# 23.5 追忆 沙 3 精通 大攻击: 4.7, 充能: 5.2, 小防御: 23.0, 爆伤: 7.0
# [None, ['杯'], ['火伤'], {'暴击': 1.0, '爆伤': 1.0, '大攻击': 0.57, '精通': 0.65}]
# 33.6 乐团 杯 3 火伤 暴击: 3.9, 精通: 16.0, 大攻击: 5.3, 小防御: 19.0
# 32.7 少女 杯 20 火伤 精通: 54.0, 爆伤: 21.0, 大生命: 4.1, 充能: 11.0
# 29.7 追忆 杯 20 火伤 小防御: 37.0, 暴击: 7.8, 小攻击: 33.0, 精通: 65.0
# 27.7 乐团 杯 3 火伤 小防御: 16.0, 爆伤: 5.4, 暴击: 3.5
# 25.6 角斗 杯 3 火伤 精通: 23.0, 暴击: 3.5, 大防御: 6.6, 小攻击: 18.0
# 24.9 追忆 杯 3 火伤 暴击: 3.9, 小生命: 239.0, 精通: 19.0
# 23.8 乐园 杯 0 火伤 大防御: 7.3, 精通: 21.0, 暴击: 3.1
# 23.4 宗室 杯 3 火伤 大攻击: 4.1, 爆伤: 7.8, 充能: 5.2
# 21.9 染血 杯 3 火伤 小生命: 269.0, 精通: 16.0, 暴击: 2.7
# [['追忆'], ['头'], ['暴击'], {'爆伤': 1.0, '大攻击': 0.57, '精通': 0.65}]
# 25.2 追忆 头 2 暴击 大攻击: 5.8, 小防御: 23.0, 充能: 5.2, 爆伤: 7.8
# 24.4 追忆 头 3 暴击 充能: 5.2, 爆伤: 7.0, 大防御: 6.6, 大攻击: 5.8
# 22.8 追忆 头 3 暴击 爆伤: 7.0, 大防御: 6.6, 大攻击: 4.7
# [['绝缘'], ['花', '羽'], None, {'暴击': 1.0, '爆伤': 1.0, '大攻击': 0.5, '精通': 0.7, '充能': 1.0}]
# 52.1 绝缘 花 20 小生命 大攻击: 10.5, 充能: 5.8, 爆伤: 23.3, 暴击: 7.4
# 49.7 绝缘 花 20 小生命 大防御: 6.6, 充能: 22.7, 爆伤: 15.5, 暴击: 3.5
# 46.3 绝缘 羽 20 小攻击 大攻击: 15.7, 充能: 11.7, 暴击: 10.9, 大生命: 4.1
# 45.7 绝缘 羽 2 小攻击 充能: 5.8, 暴击: 3.1, 小防御: 19.0, 爆伤: 7.8
# 44.9 绝缘 花 3 小生命 充能: 5.8, 爆伤: 6.2, 暴击: 3.5, 小攻击: 16.0
# 42.5 绝缘 羽 3 小攻击 小生命: 239.0, 暴击: 2.7, 充能: 5.8, 爆伤: 5.4
# 42.4 绝缘 羽 3 小攻击 精通: 23.0, 小防御: 23.0, 暴击: 3.5, 爆伤: 7.8
# 42.0 绝缘 羽 19 小攻击 小生命: 209.0, 精通: 21.0, 爆伤: 10.9, 暴击: 10.9
# 41.5 绝缘 羽 11 小攻击 大攻击: 4.1, 爆伤: 13.2, 充能: 11.0, 小生命: 239.0
# 41.2 绝缘 花 3 小生命 充能: 6.5, 小防御: 23.0, 爆伤: 6.2, 精通: 21.0
# 40.9 绝缘 羽 20 小攻击 小防御: 21.0, 爆伤: 12.4, 充能: 6.5, 精通: 89.0
# 40.7 绝缘 花 3 小生命 充能: 4.5, 爆伤: 5.4, 暴击: 3.9
# 39.2 绝缘 羽 3 小攻击 精通: 23.0, 小防御: 16.0, 爆伤: 5.4, 暴击: 3.1
# 39.2 绝缘 羽 3 小攻击 充能: 4.5, 爆伤: 7.8, 大生命: 5.8, 精通: 16.0
# 39.0 绝缘 羽 3 小攻击 精通: 21.0, 暴击: 3.9, 爆伤: 6.2
# 39.0 绝缘 羽 3 小攻击 小防御: 16.0, 大攻击: 5.3, 暴击: 3.5, 爆伤: 7.8
# 38.7 绝缘 羽 3 小攻击 充能: 4.5, 暴击: 3.9, 精通: 23.0
# 38.7 绝缘 花 3 小生命 精通: 16.0, 暴击: 3.5, 爆伤: 7.8
# 38.6 绝缘 羽 3 小攻击 暴击: 3.5, 大防御: 6.6, 大攻击: 4.7, 爆伤: 7.8
# 38.2 绝缘 羽 15 小攻击 爆伤: 19.4, 大攻击: 5.3, 小生命: 209.0, 充能: 5.8
# 38.1 绝缘 羽 15 小攻击 爆伤: 12.4, 精通: 42.0, 小生命: 209.0, 暴击: 3.5
# 37.1 绝缘 花 11 小生命 爆伤: 7.0, 小攻击: 18.0, 精通: 42.0, 充能: 5.8
# 37.0 绝缘 羽 20 小攻击 暴击: 3.9, 小生命: 478.0, 大攻击: 11.1, 爆伤: 21.8
# 36.8 绝缘 花 11 小生命 精通: 44.0, 暴击: 3.1, 小防御: 19.0, 充能: 5.8
# 36.8 绝缘 花 6 小生命 小攻击: 18.0, 精通: 21.0, 爆伤: 7.8, 充能: 5.2
# 36.6 绝缘 花 3 小生命 小防御: 21.0, 大攻击: 5.3, 爆伤: 7.0, 暴击: 2.7
# 36.2 绝缘 花 7 小生命 小攻击: 19.0, 精通: 19.0, 爆伤: 7.0, 充能: 5.8
# 35.7 绝缘 羽 20 小攻击 小生命: 269.0, 充能: 19.4, 爆伤: 12.4, 大防御: 11.7
# 35.6 绝缘 羽 0 小攻击 大攻击: 5.3, 暴击: 3.1, 爆伤: 7.0
# 35.4 绝缘 花 3 小生命 大攻击: 4.7, 爆伤: 5.4, 大防御: 7.3, 暴击: 3.1
# 35.2 绝缘 羽 7 小攻击 充能: 6.5, 小防御: 21.0, 暴击: 3.5, 大攻击: 5.8
# 35.0 绝缘 羽 20 小攻击 大防御: 11.7, 爆伤: 21.0, 充能: 11.7, 小生命: 299.0
# 34.6 绝缘 花 19 小生命 精通: 16.0, 暴击: 6.6, 小攻击: 33.0, 爆伤: 13.2
# 34.6 绝缘 花 20 小生命 爆伤: 6.2, 小攻击: 14.0, 充能: 15.5, 大攻击: 14.6
# 34.4 绝缘 羽 4 小攻击 大生命: 9.9, 充能: 6.5, 爆伤: 6.2, 大攻击: 5.8
# 34.2 绝缘 花 20 小生命 大生命: 16.9, 精通: 40.0, 暴击: 3.1, 爆伤: 18.7
# 34.2 绝缘 羽 12 小攻击 爆伤: 7.8, 小防御: 19.0, 精通: 47.0, 大攻击: 12.2
# 32.4 绝缘 羽 19 小攻击 充能: 4.5, 大攻击: 15.7, 大防御: 7.3, 爆伤: 12.4
# 32.3 绝缘 花 19 小生命 暴击: 8.6, 大攻击: 9.9, 大生命: 4.7, 精通: 21.0
# 32.3 绝缘 羽 3 小攻击 精通: 23.0, 大攻击: 4.7, 爆伤: 7.0
# 32.3 绝缘 花 3 小生命 大攻击: 5.8, 暴击: 3.1, 精通: 23.0
# 31.3 绝缘 羽 3 小攻击 充能: 6.5, 小防御: 16.0, 大防御: 5.8, 暴击: 3.5
# 31.3 绝缘 羽 3 小攻击 暴击: 3.5, 充能: 6.5, 大生命: 5.3
# 31.2 绝缘 花 15 小生命 小防御: 39.0, 大攻击: 9.3, 暴击: 6.2, 精通: 23.0
# 31.2 绝缘 羽 12 小攻击 大生命: 5.3, 充能: 9.1, 爆伤: 5.4, 大攻击: 9.9
# 30.9 绝缘 羽 11 小攻击 小防御: 21.0, 爆伤: 14.0, 暴击: 3.5, 大防御: 5.1
# 30.6 绝缘 羽 19 小攻击 大防御: 5.1, 精通: 16.0, 爆伤: 24.1, 大生命: 4.1
# 30.5 绝缘 花 3 小生命 暴击: 3.9, 大生命: 5.8, 爆伤: 6.2
# 30.5 绝缘 花 3 小生命 爆伤: 6.2, 暴击: 3.9, 小防御: 23.0
# 30.2 绝缘 羽 8 小攻击 小防御: 16.0, 爆伤: 7.8, 精通: 21.0, 大攻击: 9.9
# 29.8 绝缘 花 3 小生命 精通: 16.0, 暴击: 2.7, 大攻击: 5.8
# 29.8 绝缘 羽 16 小攻击 精通: 44.0, 大生命: 4.1, 爆伤: 6.2, 大攻击: 14.6
# 29.7 绝缘 花 3 小生命 大生命: 5.3, 小攻击: 16.0, 充能: 4.5, 爆伤: 7.8
# 29.7 绝缘 羽 3 小攻击 大生命: 4.7, 爆伤: 7.8, 小防御: 21.0, 暴击: 2.7
# 29.7 绝缘 花 3 小生命 大防御: 6.6, 充能: 4.5, 暴击: 3.9
# 29.7 绝缘 花 3 小生命 暴击: 2.7, 小防御: 21.0, 爆伤: 7.8
# 29.7 绝缘 羽 3 小攻击 暴击: 3.1, 大防御: 7.3, 爆伤: 7.0
# 29.7 绝缘 羽 3 小攻击 小生命: 209.0, 爆伤: 7.8, 暴击: 2.7
# 29.7 绝缘 花 2 小生命 暴击: 3.9, 爆伤: 5.4, 小防御: 23.0
# 29.5 绝缘 羽 18 小攻击 大生命: 5.8, 精通: 58.0, 小生命: 508.0, 暴击: 6.6
# 29.5 绝缘 羽 20 小攻击 大防御: 5.8, 小生命: 568.0, 爆伤: 29.5, 小防御: 16.0
# 29.4 绝缘 羽 19 小攻击 小防御: 44.0, 暴击: 5.8, 充能: 5.2, 大攻击: 11.1
# 29.2 绝缘 羽 16 小攻击 小生命: 299.0, 爆伤: 15.5, 精通: 47.0, 大生命: 9.3
# 28.9 绝缘 花 3 小生命 大生命: 4.7, 充能: 5.2, 暴击: 3.1
# 28.9 绝缘 羽 2 小攻击 大生命: 4.1, 爆伤: 6.2, 小防御: 19.0, 充能: 5.2
# 28.9 绝缘 羽 2 小攻击 爆伤: 5.4, 大生命: 4.7, 暴击: 3.5
# 28.7 绝缘 花 20 小生命 大防御: 6.6, 爆伤: 14.0, 小防御: 39.0, 精通: 63.0
# 28.1 绝缘 花 3 小生命 小攻击: 16.0, 爆伤: 6.2, 小防御: 23.0, 暴击: 2.7
# 28.1 绝缘 花 3 小生命 暴击: 3.1, 爆伤: 5.4, 小防御: 16.0
# 28.0 绝缘 羽 20 小攻击 大攻击: 20.4, 小生命: 598.0, 精通: 35.0, 暴击: 3.1
# 27.7 绝缘 花 0 小生命 精通: 23.0, 爆伤: 7.8, 小防御: 19.0
# 27.4 绝缘 花 20 小生命 大攻击: 5.8, 小防御: 39.0, 暴击: 5.8, 精通: 51.0
# 26.9 绝缘 羽 0 小攻击 精通: 23.0, 小防御: 19.0, 爆伤: 7.0
# 26.7 绝缘 羽 3 小攻击 小防御: 23.0, 爆伤: 7.8, 精通: 21.0, 大生命: 4.1
# 26.4 绝缘 羽 3 小攻击 大生命: 4.7, 暴击: 3.5, 精通: 21.0
# 26.2 绝缘 花 16 小生命 暴击: 7.0, 小防御: 21.0, 大攻击: 14.6, 大防御: 5.1
# 25.7 绝缘 花 20 小生命 大防御: 22.6, 大攻击: 4.7, 爆伤: 7.0, 暴击: 7.8
# 25.0 绝缘 羽 18 小攻击 精通: 35.0, 爆伤: 14.0, 大生命: 9.3, 大防御: 12.4
# 24.8 绝缘 花 20 小生命 小攻击: 51.0, 暴击: 5.8, 爆伤: 13.2, 大生命: 5.3
# 24.6 绝缘 花 15 小生命 大防御: 17.5, 大攻击: 4.7, 暴击: 3.1, 爆伤: 7.0
# 24.4 绝缘 羽 0 小攻击 精通: 16.0, 小防御: 16.0, 暴击: 3.1
# 24.2 绝缘 羽 20 小攻击 暴击: 3.9, 大生命: 15.7, 精通: 42.0, 大攻击: 9.9
# 23.6 绝缘 花 4 小生命 大生命: 5.3, 暴击: 3.5, 精通: 23.0, 小攻击: 19.0
# 23.3 绝缘 花 20 小生命 充能: 5.2, 大生命: 10.5, 大防御: 14.6, 爆伤: 17.1
# 22.5 绝缘 羽 12 小攻击 小生命: 448.0, 精通: 16.0, 暴击: 6.6, 大生命: 5.3
# 21.5 绝缘 羽 8 小攻击 暴击: 3.1, 充能: 4.5, 大生命: 4.7, 小生命: 538.0
# 20.7 绝缘 花 13 小生命 精通: 21.0, 暴击: 2.7, 大防御: 18.2, 大攻击: 4.7
# [['绝缘'], ['沙'], ['充能'], {'暴击': 1.0, '爆伤': 1.0, '大攻击': 0.5, '精通': 0.7, '充能': 1.0}]
# 39.0 绝缘 沙 3 充能 小防御: 21.0, 暴击: 3.9, 爆伤: 7.0, 大攻击: 5.3
# 23.8 绝缘 沙 2 充能 爆伤: 5.4, 大生命: 5.3, 小攻击: 16.0, 精通: 19.0
# 23.7 绝缘 沙 3 充能 大攻击: 4.1, 暴击: 3.9, 小攻击: 19.0
# 22.2 绝缘 沙 20 充能 爆伤: 18.7, 小攻击: 29.0, 小生命: 508.0, 大攻击: 5.3
# [None, ['杯'], ['火伤'], {'暴击': 1.0, '爆伤': 1.0, '大攻击': 0.5, '精通': 0.7, '充能': 1.0}]
# 46.8 少女 杯 20 火伤 精通: 54.0, 爆伤: 21.0, 大生命: 4.1, 充能: 11.0
# 41.2 乐团 杯 20 火伤 小生命: 239.0, 小防御: 35.0, 暴击: 7.0, 充能: 22.7
# 35.6 宗室 杯 3 火伤 大攻击: 4.1, 爆伤: 7.8, 充能: 5.2
# 33.2 乐团 杯 3 火伤 暴击: 3.9, 精通: 16.0, 大攻击: 5.3, 小防御: 19.0
# 31.8 绝缘 杯 20 火伤 暴击: 6.6, 充能: 15.5, 小防御: 53.0, 大防御: 5.8
# 30.7 追忆 杯 20 火伤 小防御: 37.0, 暴击: 7.8, 小攻击: 33.0, 精通: 65.0
# 30.5 角斗 杯 2 火伤 暴击: 3.9, 充能: 5.2, 小防御: 16.0
# 28.9 乐团 杯 3 火伤 小防御: 16.0, 爆伤: 5.4, 暴击: 3.5
# 28.1 绝缘 杯 3 火伤 充能: 5.2, 爆伤: 5.4, 小生命: 269.0
# 26.7 追忆 杯 3 火伤 暴击: 3.9, 小生命: 239.0, 精通: 19.0
# 26.4 角斗 杯 3 火伤 精通: 23.0, 暴击: 3.5, 大防御: 6.6, 小攻击: 18.0
# 25.6 乐园 杯 0 火伤 大防御: 7.3, 精通: 21.0, 暴击: 3.1
# 23.6 染血 杯 3 火伤 小生命: 269.0, 精通: 16.0, 暴击: 2.7
# [['绝缘'], ['头'], ['暴击'], {'爆伤': 1.0, '大攻击': 0.5, '精通': 0.7, '充能': 1.0}]
# 30.7 绝缘 头 3 暴击 精通: 19.0, 大攻击: 4.7, 爆伤: 7.0
# 29.8 绝缘 头 20 暴击 充能: 11.0, 大生命: 9.3, 大攻击: 19.2, 精通: 16.0
# 26.4 绝缘 头 20 暴击 爆伤: 26.4, 小防御: 39.0, 小攻击: 33.0, 大防御: 6.6
# 25.4 绝缘 头 3 暴击 大生命: 4.7, 精通: 19.0, 小防御: 23.0, 充能: 5.8
# 22.0 绝缘 头 3 暴击 爆伤: 6.2, 大攻击: 5.3, 小攻击: 16.0
# 21.8 绝缘 头 20 暴击 小生命: 837.0, 小防御: 19.0, 爆伤: 21.8, 大生命: 4.7
# 20.2 绝缘 头 20 暴击 爆伤: 20.2, 小攻击: 14.0, 小防御: 58.0, 大防御: 13.1
# 20.0 绝缘 头 7 暴击 小生命: 209.0, 充能: 5.2, 小攻击: 16.0, 大攻击: 5.8
# ```

# In[ ]:




